In [1]:
import pandas as pd

In [2]:
data = {"a":[1,2,3,4],
       "b":[4,5,6,7],
       "c":["sudh" , "krish","hitesh","navin"]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [5]:
df.set_index('a',inplace=True)

In [6]:
df

   b       c
a
1  4    sudh
2  5   krish
3  6  hitesh
4  7   navin

In [7]:
df.reset_index(inplace=True)

In [8]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [9]:
data = {"a":[1,2,3,4],
       "b":[4,5,6,7],
       "c":["sudh" , "krish","hitesh","navin"]}
df1 = pd.DataFrame(data,index = ['a','b','c','d'])

In [10]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [11]:
df1=df1.reindex(['b','c','d','a'])
# reindexing will will rearrange the rows and will not perform the reassingment of the indices

In [12]:
df1

   a  b       c
b  2  5   krish
c  3  6  hitesh
d  4  7   navin
a  1  4    sudh

In [13]:
for i in df1.iterrows():
    print(i)
    print(type(i))
    print(i[0])
    print(type(i[1]))

('b', a        2
b        5
c    krish
Name: b, dtype: object)
<class 'tuple'>
b
<class 'pandas.core.series.Series'>
('c', a         3
b         6
c    hitesh
Name: c, dtype: object)
<class 'tuple'>
c
<class 'pandas.core.series.Series'>
('d', a        4
b        7
c    navin
Name: d, dtype: object)
<class 'tuple'>
d
<class 'pandas.core.series.Series'>
('a', a       1
b       4
c    sudh
Name: a, dtype: object)
<class 'tuple'>
a
<class 'pandas.core.series.Series'>

In [14]:
for i in df1.items():
    print(i)

('a', b    2
c    3
d    4
a    1
Name: a, dtype: int64)
('b', b    5
c    6
d    7
a    4
Name: b, dtype: int64)
('c', b     krish
c    hitesh
d     navin
a      sudh
Name: c, dtype: object)

In [15]:
for i in iter(df1):
    print(i)

a
b
c

In [16]:
for i,j in df1.iterrows():
    print(i,j)

b a        2
b        5
c    krish
Name: b, dtype: object
c a         3
b         6
c    hitesh
Name: c, dtype: object
d a        4
b        7
c    navin
Name: d, dtype: object
a a       1
b       4
c    sudh
Name: a, dtype: object

In [17]:
for i in df1.iterrows():
    print(i)

('b', a        2
b        5
c    krish
Name: b, dtype: object)
('c', a         3
b         6
c    hitesh
Name: c, dtype: object)
('d', a        4
b        7
c    navin
Name: d, dtype: object)
('a', a       1
b       4
c    sudh
Name: a, dtype: object)

In [18]:
for i in df1.items():
    print(i)

('a', b    2
c    3
d    4
a    1
Name: a, dtype: int64)
('b', b    5
c    6
d    7
a    4
Name: b, dtype: int64)
('c', b     krish
c    hitesh
d     navin
a      sudh
Name: c, dtype: object)

In [19]:
df1

   a  b       c
b  2  5   krish
c  3  6  hitesh
d  4  7   navin
a  1  4    sudh

In [20]:
# iter rows will iterate through the data along the rows
# data  will be represented in relation to rows headers
# the each subsequent iteration will vary along the indices

# items will iterate though the columns
# data will be represented in relation to table indices
# Each subquesent iteration will vary along table headers

In [21]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [22]:
list(df['a'])
# will not list the indices

[1, 2, 3, 4]

In [23]:
[i for i in df['a']]

[1, 2, 3, 4]

In [24]:
df1.sum()

a                      10
b                      22
c    krishhiteshnavinsudh
dtype: object

In [25]:
def test(x):
    return x.sum()
df1.apply(test)

a                      10
b                      22
c    krishhiteshnavinsudh
dtype: object

In [26]:
df1.apply(lambda x : x.sum())

a                      10
b                      22
c    krishhiteshnavinsudh
dtype: object

In [27]:
df2=df1[['a','b']]

In [28]:
df2.applymap(lambda x : x*x)

    a   b
b   4  25
c   9  36
d  16  49
a   1  16

In [29]:
df1.sort_values('a')

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [30]:
df1.reset_index(inplace=True)

In [31]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [32]:
df1.sort_values('c',inplace=True)
df1

  index  a  b       c
1     c  3  6  hitesh
0     b  2  5   krish
2     d  4  7   navin
3     a  1  4    sudh

In [33]:
df1.sort_index(inplace=True)
df1

  index  a  b       c
0     b  2  5   krish
1     c  3  6  hitesh
2     d  4  7   navin
3     a  1  4    sudh

In [34]:
df1.sort_index(ascending=False)

  index  a  b       c
3     a  1  4    sudh
2     d  4  7   navin
1     c  3  6  hitesh
0     b  2  5   krish

In [35]:
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language."] })

In [36]:
df3

                                                Desc
0  Data Science Masters course is highly curated ...

In [37]:
pd.set_option("display.max_colwidth",5000)

In [38]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.

In [39]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.

In [40]:
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language." , "my name is sudh" ,"i use to teach data science "] })

In [41]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                my name is sudh
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   i use to teach data science

In [42]:
df3['len']=df3['Desc'].apply(len)
df3

,Desc,len
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,my name is sudh,15
2,i use to teach data science,28

In [43]:
df3['word_count'] = df3['Desc'].apply(lambda x : len(x.split()))
df3

,Desc,len,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,104
1,my name is sudh,15,4
2,i use to teach data science,28,6

In [44]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [45]:
df['a'][0]

1

In [46]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [47]:
df['a'].mean()

2.5

In [48]:
df['a'].median()

2.5

In [49]:
df['a'].max()

4

In [50]:
df['a'].var()

1.6666666666666667

In [51]:
df['a'].std()

1.2909944487358056

In [52]:
df['a'].min()

1

In [53]:
df['a'].sum()

10

In [54]:
#Python Pandas - Window Functions
df4 = pd.DataFrame({'a' : [3,4,5,2,1,3,4,5,6]})

In [55]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [56]:
df4['a'].rolling(window=1).mean()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [57]:
df4['a'].rolling(window=2).mean()

0    NaN
1    3.5
2    4.5
3    3.5
4    1.5
5    2.0
6    3.5
7    4.5
8    5.5
Name: a, dtype: float64

In [58]:
df4['a'].rolling(window=3).sum()

0     NaN
1     NaN
2    12.0
3    11.0
4     8.0
5     6.0
6     8.0
7    12.0
8    15.0
Name: a, dtype: float64

In [59]:
df4['a'].cummax()

0    3
1    4
2    5
3    5
4    5
5    5
6    5
7    5
8    6
Name: a, dtype: int64

In [60]:
df4['a'].cumsum()

0     3
1     7
2    12
3    14
4    15
5    18
6    22
7    27
8    33
Name: a, dtype: int64

In [61]:
date=pd.date_range(start='2023-04-23' , end = '2023-06-23')

In [62]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

In [63]:
df_date = pd.DataFrame({"date":date})

In [64]:
df_date

         date
0  2023-04-23
1  2023-04-24
2  2023-04-25
3  2023-04-26
4  2023-04-27
..        ...
57 2023-06-19
58 2023-06-20
59 2023-06-21
60 2023-06-22
61 2023-06-23

[62 rows x 1 columns]

In [65]:
df_date.dtypes

date    datetime64[ns]
dtype: object

In [66]:
df7 = pd.DataFrame({"date" : ['2023-06-23' , '2023-06-22','2023-06-20']})

In [67]:
df7.dtypes

date    object
dtype: object

In [68]:
df7['updated_date']=pd.to_datetime(df7['date'])

In [69]:
df7.dtypes

date                    object
updated_date    datetime64[ns]
dtype: object

In [70]:
df7['Year']=df7['updated_date'].dt.year

In [71]:
df7

         date updated_date  Year
0  2023-06-23   2023-06-23  2023
1  2023-06-22   2023-06-22  2023
2  2023-06-20   2023-06-20  2023

In [74]:
df7['updated_date'].dt

In [75]:
df7['month']=df7['updated_date'].dt.month
df7['day']=df7['updated_date'].dt.day

In [76]:
df7

         date updated_date  Year  month  day
0  2023-06-23   2023-06-23  2023      6   23
1  2023-06-22   2023-06-22  2023      6   22
2  2023-06-20   2023-06-20  2023      6   20

In [81]:
# Time Delta
pd.Timedelta(days=1,hours=1,minutes=1)

Timedelta('1 days 01:01:00')

In [83]:
dt=pd.Timedelta(weeks=1,hours=1.5)
dt

Timedelta('7 days 01:30:00')

In [84]:
df7['updated_date'][0]+dt

Timestamp('2023-06-30 01:30:00')